<?php

return [
    'title' => 'សារ',
    'msg' => [
        'disable'           => 'តើអ្នកប្រាកដក្នុងការបិទទិន្នន័យនេះទេ ',
        'enable'            => 'តើអ្នកប្រាកដក្នុងការបើកទិន្នន័យនេះទេ ',
        'reject'            => 'Are you sure to reject',
        'approve'           => 'Are you sure to approve',
        'confirm'           => 'Are you sure to confirm',
        'complete'          => 'Are you sure to complete',
        'agree'             => 'Are you sure to agree',
        'delete'            => 'តើអ្នកប្រាកដក្នុងការលុបទិន្នន័យនេះទេ',
        'restore'           => 'តើអ្នកប្រាកដក្នុងការស្តារទិន្ន័យនេះឡើងវិញទេ',
        'move_to_trash'     => 'តើអ្នកប្រាកដថាដាក់ទិន្ន័យនេះទៅធុងសំរាមទេ',
        'save'              => 'តើអ្នកប្រាកដក្នុងការរក្សាទុកទិន្នន័យនេះទេ',
        'sign_out'          => 'តើ​អ្នក​ចង់​ចាកចេញ?',
        'update'            => 'តើអ្នកប្រាកដក្នុងការកែប្រែទិន្នន័យនេះទេ',
        'cancel'            => 'តើអ្នកប្រាកដក្នុងការបោះបង់ទេ?',
        'check_out'         => 'តើអ្នកប្រាកដក្នុងការចាកចេញទេ?',
        'void'              => 'តើ​អ្នក​ប្រាកដ​ជា​ទុក​ជា​មោឃៈ',
        'assign_permission' => 'តើអ្នកប្រាកដក្នុងការផ្តល់ការអនុញ្ញាតទេ?',
        'invoice_detail'    => 'តើអ្នកប្រាកដក្នុងការមើលវិក្កយបត្រទេ?'
    ],
    'button' => [
        'ok'                => 'យល់ព្រម',
        'delete'            => 'លុប',
        'disable'           => 'បិត',
        'approve'           => 'Approve',
        'confirm'           => 'Confirm',
        'complete'          => 'Complete',
        'enable'            => 'បើក',
        'restore'           => 'ស្ដារឡើងវិញ',
        'cancel'            => 'បោះបង់',
        'sign_out'          => 'ចាកចេញ',
        'agree'             => 'យល់ព្រម',
        'reject'            => 'Reject',
        'move_to_trash'     => 'ដាក់ធុងសំរាម',
        'save'              => 'រក្សាទុក',
        'update'            => 'កែប្រែ',
        'close'             => 'បោះបង់',
        'unselect'          => 'មិនជ្រើសរើស',
        'check_out'         => 'ចាកចេញ',
        'void'              => 'ទុក​ជា​មោឃៈ',
        'select_all'        => 'ជ្រើសរើសទាំងអស់',
        'view_invoice'      => 'មើលវិក្កយបត្រ',

    ],
    'toast' => [
        'save' => [
            'title' => [
                'success'   => 'រក្សាទុក ជោគជ័យ',
                'error'     => 'រក្សាទុក មិនជោគជ័យ',
            ],
            'msg' => [
                'success'   => 'រក្សាទុកទិន្នន័យដោយជោគជ័យ!',
                'error'     => 'រក្សាទុកទិន្នន័យបរាជ័យ!',
            ],
        ],
        'update' => [
            'title' => [
                'success'   => 'ការកែប្រែជោគជ័យ',
                'error'     => 'ការកែប្រែ​ បរាជ័យ',
            ],
            'msg' => [
                'success'   => 'កែប្រែទិន្នន័យដោយជោគជ័យ!',
                'error'     => 'ការកែប្រែទិន្នន័យបានបរាជ័យ!',
            ],
        ]
    ],
    'empty' => [
        'title'     => 'មិនមានទិន្នន័យ',
        'message'   => 'សុំទោស! សូមសាកល្បងទិន្នន័យផ្សេង ឬលើកក្រោយទៀត',
    ],
];
